app/views/users/show.html.erb

        <% totaltrue = user.cursosusuario.where(nivel32014: true).count * 10 %>
        <% total = user.cursosusuario.find(:all).count %>
---
SELECT "cursos".* FROM "cursos" WHERE "cursos"."id" = $1 ORDER BY "cursos"."id" ASC LIMIT 1  [["id", 135]]
SELECT "cursosusuario".* FROM "cursosusuario" WHERE "cursosusuario"."user_id" = $1  [["user_id", 1]]