app/views/users/show.html.erb

SELECT "microposts".* FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships
---
      <strong>URL</strong>  <%= link_to user_path(@user), @user %><br />
      <strong>Microposts</strong> <%= @user.microposts.count %>

SELECT 1 AS one FROM "microposts" WHERE "microposts"."user_id" = $1 ORDER BY created_at DESC LIMIT 1  [["user_id", 1]]
---
    <div class="col-md-6" style="margin-top: 100px">
      <% if @user.microposts.any? %>