app/views/shared/_feed_item.html.erb

    <div class="col-md-2">
      <% if feed_item.user.photo_file_name.blank?  %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1