app/views/cursos/index.html.erb

SELECT "cursos".* FROM "cursos" INNER JOIN "cursosusuario" ON "cursos"."id" = "cursosusuario"."curso_id" WHERE "cursosusuario"."user_id" = $1 AND "cursos"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 1]]
SELECT "cursosusuario".* FROM "cursosusuario" WHERE "cursosusuario"."user_id" = $1  [["user_id", 1]]
---
  </tr>
  <%	 current_user.cursosusuario.each do |x| %>