app/controllers/cursos_controller.rb

SELECT "cursos".* FROM "cursos"
---
  def index
    @cursos = Curso.all

SELECT "cursos".* FROM "cursos" WHERE "cursos"."id" = $1 LIMIT 1  [["id", "135"]]
---
  def show
    @curso = Curso.friendly.find(params[:id])

SELECT "cursos".* FROM "cursos" WHERE "cursos"."id" = $1 ORDER BY "cursos"."id" ASC LIMIT 1  [["id", 135]]
---
    def set_curso
      @curso = Curso.friendly.find(params[:id])