app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Hola"], ["created_at", Tue, 03 Jun 2014 04:44:55 UTC +00:00], ["updated_at", Tue, 03 Jun 2014 04:44:55 UTC +00:00], ["user_id", 1]]