app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.paginate(page: params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = $1 ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT "eventos".* FROM "eventos" WHERE "eventos"."user_id" = $1 ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT "micrositios".* FROM "micrositios" WHERE "micrositios"."user_id" = $1 LIMIT 30 OFFSET 0  [["user_id", 1]]
---
  def show
    @user = User.friendly.find(params[:id])
    @users = User.all
    @microposts = @user.microposts.paginate(page: params[:page])
    @eventos = @user.eventos.paginate(page: params[:page])
    @micrositios = @user.micrositios.paginate(page: params[:page])